STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_ca35.h
   PCIE_MSI7_IRQn                   = 369,     /*!< PCIe MSI interrupt #7                                               */
   PCIE_MSI8_IRQn                   = 370,     /*!< PCIe MSI interrupt #8                                               */
   PCIE_MSI9_IRQn                   = 371,     /*!< PCIe MSI interrupt #9                                               */
   PCIE_MSI10_IRQn                  = 372,     /*!< PCIe MSI interrupt #10                                              */
   PCIE_MSI11_IRQn                  = 373,     /*!< PCIe MSI interrupt #11                                              */
   PCIE_MSI12_IRQn                  = 374,     /*!< PCIe MSI interrupt #12                                              */
   PCIE_MSI13_IRQn                  = 375,     /*!< PCIe MSI interrupt #13                                              */
   PCIE_MSI14_IRQn                  = 376,     /*!< PCIe MSI interrupt #14                                              */
   PCIE_MSI15_IRQn                  = 377,     /*!< PCIe MSI interrupt #15                                              */
   PCIE_MSI16_IRQn                  = 378,     /*!< PCIe MSI interrupt #16                                              */
   PCIE_MSI17_IRQn                  = 379,     /*!< PCIe MSI interrupt #17                                              */
   PCIE_MSI18_IRQn                  = 380,     /*!< PCIe MSI interrupt #18                                              */
   PCIE_MSI19_IRQn                  = 381,     /*!< PCIe MSI interrupt #19                                              */
   PCIE_MSI20_IRQn                  = 382,     /*!< PCIe MSI interrupt #20                                              */
   PCIE_MSI21_IRQn                  = 383,     /*!< PCIe MSI interrupt #21                                              */
   PCIE_MSI22_IRQn                  = 384,     /*!< PCIe MSI interrupt #22                                              */
   PCIE_MSI23_IRQn                  = 385,     /*!< PCIe MSI interrupt #23                                              */
   PCIE_MSI24_IRQn                  = 386,     /*!< PCIe MSI interrupt #24                                              */
   PCIE_MSI25_IRQn                  = 387,     /*!< PCIe MSI interrupt #25                                              */
   PCIE_MSI26_IRQn                  = 388,     /*!< PCIe MSI interrupt #26                                              */
   PCIE_MSI27_IRQn                  = 389,     /*!< PCIe MSI interrupt #27                                              */
   PCIE_MSI28_IRQn                  = 390,     /*!< PCIe MSI interrupt #28                                              */
   PCIE_MSI29_IRQn                  = 391,     /*!< PCIe MSI interrupt #29                                              */
   PCIE_MSI30_IRQn                  = 392,     /*!< PCIe MSI interrupt #30                                              */
   PCIE_MSI31_IRQn                  = 393,     /*!< PCIe MSI interrupt #31                                              */
   RESERVED_394                     = 394,     /*!< reserved                                                            */
   RESERVED_395                     = 395,     /*!< reserved                                                            */
   RESERVED_396                     = 396,     /*!< reserved                                                            */
   RESERVED_397                     = 397,     /*!< reserved                                                            */
   RESERVED_398                     = 398,     /*!< reserved                                                            */
   RESERVED_399                     = 399,     /*!< reserved                                                            */
   PMUIRQ0_IRQn                     = 400,     /*!< Cortex-A35 Core#0 Performance Monitor interrupt                     */
   PMUIRQ1_IRQn                     = 401,     /*!< Cortex-A35 Core#1 Performance Monitor interrupt                     */
   RESERVED_402                     = 402,     /*!< reserved                                                            */
   RESERVED_403                     = 403,     /*!< reserved                                                            */
   COMMRX0_IRQn                     = 404,     /*!< Cortex-A35 Core#0 Debug Communication Channel Receive interrupt     */
   COMMRX1_IRQn                     = 405,     /*!< Cortex-A35 Core#1 Debug Communication Channel Receive interrupt     */
   RESERVED_406                     = 406,     /*!< reserved                                                            */
   RESERVED_407                     = 407,     /*!< reserved                                                            */
   COMMTX0_IRQn                     = 408,     /*!< Cortex-A35 Core#0 Debug Communication Channel Transmit interrupt    */
   COMMTX1_IRQn                     = 409,     /*!< Cortex-A35 Core#1 Debug Communication Channel Transmit interrupt    */
   RESERVED_410                     = 410,     /*!< reserved                                                            */
   RESERVED_411                     = 411,     /*!< reserved                                                            */
   nCTIIRQ0_IRQn                    = 412,     /*!< Cortex-A35 Core#0 Cross Trigger Interface interrupt                 */
   nCTIIRQ1_IRQn                    = 413,     /*!< Cortex-A35 Core#1 Cross Trigger Interface interrupt                 */
   RESERVED_414                     = 414,     /*!< reserved                                                            */
   RESERVED_415                     = 415,     /*!< reserved                                                            */
   MAX_IRQ_n
 } IRQn_Type;


/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */

/**
  * @brief Configuration of the Cortex-A35 Processor and Core Peripherals
  */
#define __A35_REV                0x0100U      /*!< Cortex-A35 revision r1p0                    */
#define __CORTEX_A                   7U       /*!< Cortex-A# Core - WARNINGS :                 */
                                              /*!< - set to A7 to get something from core_ca.h */
                                              /*!< - to be set to "35U" once A35 is supported  */
                                              /*!<   by CMSIS core_ca                          */
#define __CA_REV                 0x0100U      /*!< Core (A35) revision r1p0                    */
#define __FPU_PRESENT                 1U      /*!< Set to 1 if FPU is present                  */
#define __GIC_PRESENT                 1U      /*!< Set to 1 if GIC is present                  */
#define __TIM_PRESENT                 1U      /*!< Set to 1 if TIM is present                  */
#define __L2C_PRESENT                 0U      /*!< Set to 1 if L2C is present                  */

#define GIC_BASE             0x4AC00000UL
#define GIC_DISTRIBUTOR_BASE (GIC_BASE+0x10000UL)
#define GIC_INTERFACE_BASE   (GIC_BASE+0x20000UL)
/* Number of implemented interrupt lines */
/* to be computed from GICD_TYPER.ITLinesNumber, bits [4:0] = NUM_SPIS/32 */
/* 0xC = 12 --> (12+1)*32 = 416 */
#define IRQ_GIC_LINE_COUNT   (416U)
/* Number of priority bits according to A35 security state */
#if defined(A35_NON_SECURE)
#define GIC_PRIO_BITS                 4U
#else
#define GIC_PRIO_BITS                 5U
#endif /* defined(A35_NON_SECURE) */
#define GIC_PRIORITY(x)               ((x)<<(8U-GIC_PRIO_BITS))
#include "core_ca.h"

/**
  * @}
  */

#include "system_stm32mp2xx.h"
#include <stdint.h>

