STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_ca35.h
  __IO uint32_t I2C1CFGR;          /*!< RCC I2C1 Configuration Register                                               Address offset: 0x7a4 */
  __IO uint32_t I2C2CFGR;          /*!< RCC I2C2 Configuration Register                                               Address offset: 0x7a8 */
  __IO uint32_t I2C3CFGR;          /*!< RCC I2C3 Configuration Register                                               Address offset: 0x7ac */
  __IO uint32_t I2C4CFGR;          /*!< RCC I2C4 Configuration Register                                               Address offset: 0x7b0 */
  __IO uint32_t I2C5CFGR;          /*!< RCC I2C5 Configuration Register                                               Address offset: 0x7b4 */
  __IO uint32_t I2C6CFGR;          /*!< RCC I2C6 Configuration Register                                               Address offset: 0x7b8 */
  __IO uint32_t I2C7CFGR;          /*!< RCC I2C7 Configuration Register                                               Address offset: 0x7bc */
  __IO uint32_t I2C8CFGR;          /*!< RCC I2C8 Configuration Register                                               Address offset: 0x7c0 */
  __IO uint32_t SAI1CFGR;          /*!< RCC SAI1 Configuration Register                                               Address offset: 0x7c4 */
  __IO uint32_t SAI2CFGR;          /*!< RCC SAI2 Configuration Register                                               Address offset: 0x7c8 */
  __IO uint32_t SAI3CFGR;          /*!< RCC SAI3 Configuration Register                                               Address offset: 0x7cc */
  __IO uint32_t SAI4CFGR;          /*!< RCC SAI4 Configuration Register                                               Address offset: 0x7d0 */
       uint32_t RESERVED9;         /*!< Reserved                                                                      Address offset: 0x7d4 */
  __IO uint32_t MDF1CFGR;          /*!< RCC MDF1 Configuration Register                                               Address offset: 0x7d8 */
  __IO uint32_t ADF1CFGR;          /*!< RCC ADF1 Configuration Register                                               Address offset: 0x7dc */
  __IO uint32_t FDCANCFGR;         /*!< RCC FDCAN Configuration Register                                              Address offset: 0x7e0 */
  __IO uint32_t HDPCFGR;           /*!< RCC HDP Configuration Register                                                Address offset: 0x7e4 */
  __IO uint32_t ADC12CFGR;         /*!< RCC ADC12 Configuration Register                                              Address offset: 0x7e8 */
  __IO uint32_t ADC3CFGR;          /*!< RCC ADC3 Configuration Register                                               Address offset: 0x7ec */
  __IO uint32_t ETH1CFGR;          /*!< RCC Ethernet 1 Configuration Register                                         Address offset: 0x7f0 */
  __IO uint32_t ETH2CFGR;          /*!< RCC Ethernet 2 Configuration Register                                         Address offset: 0x7f4 */
       uint32_t RESERVED10;        /*!< Reserved                                                                      Address offset: 0x7f8 */
  __IO uint32_t USBHCFGR;          /*!< RCC USBH Configuration Register                                               Address offset: 0x7fc */
  __IO uint32_t USB2PHY1CFGR;      /*!< RCC USB2PHY1 Configuration Register                                           Address offset: 0x800 */
  __IO uint32_t USB2PHY2CFGR;      /*!< RCC USB2PHY2 Configuration Register                                           Address offset: 0x804 */
  __IO uint32_t USB3DRDCFGR;       /*!< RCC USB3DRD Configuration Register                                            Address offset: 0x808 */
  __IO uint32_t USB3PCIEPHYCFGR;   /*!< RCC USB3PCIEPHY Configuration Register                                        Address offset: 0x80c */
  __IO uint32_t PCIECFGR;          /*!< RCC PCIE Configuration Register                                               Address offset: 0x810 */
  __IO uint32_t UCPDCFGR;          /*!< RCC UCPD Configuration Register                                              Address offset: 0x814 */
  __IO uint32_t ETHSWCFGR;         /*!< RCC Ethernet switch Configuration Register                                    Address offset: 0x818 */
  __IO uint32_t ETHSWACMCFGR;      /*!< RCC Ethernet switch ACM Configuration Register                                Address offset: 0x81c */
  __IO uint32_t ETHSWACMMSGCFGR;   /*!< RCC Ethernet switch ACM Message Configuration Register                        Address offset: 0x820 */
  __IO uint32_t STGENCFGR;         /*!< RCC STGEN Configuration Register                                              Address offset: 0x824 */
       uint32_t RESERVED11[2];     /*!< Reserved                                                                      Address offset: 0x828-0x82c */
  __IO uint32_t SDMMC1CFGR;        /*!< RCC SDMMC1 Configuration Register                                             Address offset: 0x830 */
  __IO uint32_t SDMMC2CFGR;        /*!< RCC SDMMC2 Configuration Register                                             Address offset: 0x834 */
  __IO uint32_t SDMMC3CFGR;        /*!< RCC SDMMC3 Configuration Register                                             Address offset: 0x838 */
  __IO uint32_t GPUCFGR;           /*!< RCC GPU Configuration Register                                                Address offset: 0x83c */
  __IO uint32_t LTDCCFGR;          /*!< RCC LTDC Configuration Register                                               Address offset: 0x840 */
  __IO uint32_t DSICFGR;           /*!< RCC DSI Configuration Register                                                Address offset: 0x844 */
       uint32_t RESERVED12[2];     /*!< Reserved                                                                      Address offset: 0x848-0x84c */
  __IO uint32_t LVDSCFGR;          /*!< RCC LVDS Configuration Register                                               Address offset: 0x850 */
       uint32_t RESERVED13;        /*!< Reserved                                                                      Address offset: 0x854 */
  __IO uint32_t CSI2CFGR;          /*!< RCC CSI2 Configuration Register                                               Address offset: 0x858 */
  __IO uint32_t DCMIPPCFGR;        /*!< RCC DCMIPP Configuration Register                                             Address offset: 0x85c */
  __IO uint32_t CCICFGR;           /*!< RCC CCI Configuration Register                                                Address offset: 0x860 */
  __IO uint32_t VDECCFGR;          /*!< RCC VDEC Configuration Register                                               Address offset: 0x864 */
  __IO uint32_t VENCCFGR;          /*!< RCC VENC Configuration Register                                               Address offset: 0x868 */
       uint32_t RESERVED14;        /*!< Reserved                                                                      Address offset: 0x86c */
  __IO uint32_t RNGCFGR;           /*!< RCC RNG Configuration Register                                                Address offset: 0x870 */
  __IO uint32_t PKACFGR;           /*!< RCC PKA Configuration Register                                                Address offset: 0x874 */
  __IO uint32_t SAESCFGR;          /*!< RCC SAES Configuration Register                                               Address offset: 0x878 */
  __IO uint32_t HASHCFGR;          /*!< RCC HASH Configuration Register                                               Address offset: 0x87c */
  __IO uint32_t CRYP1CFGR;         /*!< RCC CRYP1 Configuration Register                                              Address offset: 0x880 */
  __IO uint32_t CRYP2CFGR;         /*!< RCC CRYP2 Configuration Register                                              Address offset: 0x884 */
  __IO uint32_t IWDG1CFGR;         /*!< RCC IWDG1 Configuration Register                                              Address offset: 0x888 */
  __IO uint32_t IWDG2CFGR;         /*!< RCC IWDG2 Configuration Register                                              Address offset: 0x88c */
  __IO uint32_t IWDG3CFGR;         /*!< RCC IWDG3 Configuration Register                                              Address offset: 0x890 */
  __IO uint32_t IWDG4CFGR;         /*!< RCC IWDG4 Configuration Register                                              Address offset: 0x894 */
  __IO uint32_t IWDG5CFGR;         /*!< RCC IWDG5 Configuration Register                                              Address offset: 0x898 */
  __IO uint32_t WWDG1CFGR;         /*!< RCC WWDG1 Configuration Register                                              Address offset: 0x89c */
  __IO uint32_t WWDG2CFGR;         /*!< RCC WWDG2 Configuration Register                                              Address offset: 0x8a0 */
       uint32_t RESERVED15;        /*!< Reserved                                                                      Address offset: 0x08A4 */
  __IO uint32_t VREFCFGR;          /*!< RCC VREF Configuration Register                                               Address offset: 0x8a8 */
  __IO uint32_t DTSCFGR;           /*!< RCC DTS Configuration Register                                                Address offset: 0x8ac */
       uint32_t RESERVED16;        /*!< Reserved                                                                      Address offset: 0x8b0 */
  __IO uint32_t CRCCFGR;           /*!< RCC CRC Configuration Register                                                Address offset: 0x8b4 */
  __IO uint32_t SERCCFGR;          /*!< RCC SERC Configuration Register                                               Address offset: 0x8b8 */
  __IO uint32_t OSPIIOMCFGR;       /*!< RCC OCTOSPI IOMANAGER Configuration Register                                  Address offset: 0x8bc */
  __IO uint32_t GICV2MCFGR;        /*!< RCC GICV2M Configuration Register                                             Address offset: 0x8c0 */
       uint32_t RESERVED17;        /*!< Reserved                                                                      Address offset: 0x8c4 */
  __IO uint32_t I3C1CFGR;          /*!< RCC I3C1 Configuration Register                                               Address offset: 0x8c8 */
  __IO uint32_t I3C2CFGR;          /*!< RCC I3C2 Configuration Register                                               Address offset: 0x8cc */
  __IO uint32_t I3C3CFGR;          /*!< RCC I3C3 Configuration Register                                               Address offset: 0x8d0 */
  __IO uint32_t I3C4CFGR;          /*!< RCC I3C4 Configuration Register                                               Address offset: 0x8d4 */
       uint32_t RESERVED18[458];   /*!< Reserved                                                                      Address offset: 0x8d8-0x9fc */
  __IO uint32_t MUXSELCFGR;        /*!< RCC MUXSEL Configuration Register                                             Address offset: 0x1000 */
       uint32_t RESERVED19[5];     /*!< Reserved                                                                      Address offset: 0x1004-0x1014 */
  __IO uint32_t XBARxCFGR[64];     /*!< RCC Cross Bar x Configuration Register (x=0 to 63)                            Address offset: 0x1018-0x1114 */
  __IO uint32_t PREDIVxCFGR[64];   /*!< RCC Pre Divider x Configuration Register (x=0 to 63)                          Address offset: 0x1118-0x1214 */
  __IO uint32_t PREDIVSR1;         /*!< RCC Pre Divider Status Register 1                                             Address offset: 0x1218 */
  __IO uint32_t PREDIVSR2;         /*!< RCC Pre Divider Status Register 2                                             Address offset: 0x121c */
       uint32_t RESERVED20;        /*!< Reserved                                                                      Address offset: 0x1220 */
  __IO uint32_t FINDIVxCFGR[64];   /*!< RCC Final Divider x Configuration Register (x=0 to 63)                        Address offset: 0x1224-0x1320 */
  __IO uint32_t FINDIVSR1;         /*!< RCC Final Divider Status Register 1                                           Address offset: 0x1324 */
  __IO uint32_t FINDIVSR2;         /*!< RCC Final Divider Status Register 2                                           Address offset: 0x1328 */
       uint32_t RESERVED21[5];     /*!< Reserved                                                                      Address offset: 0x132c-0x133c */
  __IO uint32_t FCALCOBS0CFGR;     /*!< RCC Clock Frequency Calculator and Observation 0 clock Configuration Register Address offset: 0x1340 */
  __IO uint32_t FCALCOBS1CFGR;     /*!< RCC Clock Frequency Calculator and Observation 1 clock Configuration Register Address offset: 0x1344 */
  __IO uint32_t FCALCREFCFGR;      /*!< RCC Clock Frequency Calculator Reference clock Configuration Register         Address offset: 0x1348 */
  __IO uint32_t FCALCCR1;          /*!< RCC Clock Frequency Calculator Control Register 1                             Address offset: 0x134c */
       uint32_t RESERVED22;        /*!< Reserved                                                                      Address offset: 0x1350 */
  __IO uint32_t FCALCCR2;          /*!< RCC Clock Frequency Calculator Control Register 2                             Address offset: 0x1354 */
  __IO uint32_t FCALCSR;           /*!< RCC Clock Frequency Calculator Status Register                                Address offset: 0x1358 */
       uint32_t RESERVED23;        /*!< Reserved                                                                      Address offset: 0x135c */
  __IO uint32_t PLL4CFGR1;         /*!< RCC PLL{y} Configuration Register 1                                           Address offset: 0x1360 */
  __IO uint32_t PLL4CFGR2;         /*!< RCC PLL{y} Configuration Register 2                                           Address offset: 0x1364 */
  __IO uint32_t PLL4CFGR3;         /*!< RCC PLL{y} Configuration Register 3                                           Address offset: 0x1368 */
  __IO uint32_t PLL4CFGR4;         /*!< RCC PLL{y} Configuration Register 4                                           Address offset: 0x136c */
  __IO uint32_t PLL4CFGR5;         /*!< RCC PLL{y} Configuration Register 5                                           Address offset: 0x1370 */
       uint32_t RESERVED24;        /*!< Reserved                                                                      Address offset: 0x1374 */
  __IO uint32_t PLL4CFGR6;         /*!< RCC PLL{y} Configuration Register 6                                           Address offset: 0x1378 */
  __IO uint32_t PLL4CFGR7;         /*!< RCC PLL{y} Configuration Register 7                                           Address offset: 0x137c */
       uint32_t RESERVED25[2];     /*!< Reserved                                                                      Address offset: 0x1380-0x1384 */
  __IO uint32_t PLL5CFGR1;         /*!< RCC PLL{y} Configuration Register 1                                           Address offset: 0x1388 */
  __IO uint32_t PLL5CFGR2;         /*!< RCC PLL{y} Configuration Register 2                                           Address offset: 0x138c */
  __IO uint32_t PLL5CFGR3;         /*!< RCC PLL{y} Configuration Register 3                                           Address offset: 0x1390 */
  __IO uint32_t PLL5CFGR4;         /*!< RCC PLL{y} Configuration Register 4                                           Address offset: 0x1394 */
  __IO uint32_t PLL5CFGR5;         /*!< RCC PLL{y} Configuration Register 5                                           Address offset: 0x1398 */
       uint32_t RESERVED26;        /*!< Reserved                                                                      Address offset: 0x139c */
  __IO uint32_t PLL5CFGR6;         /*!< RCC PLL{y} Configuration Register 6                                           Address offset: 0x13a0 */
  __IO uint32_t PLL5CFGR7;         /*!< RCC PLL{y} Configuration Register 7                                           Address offset: 0x13a4 */
       uint32_t RESERVED27[2];     /*!< Reserved                                                                      Address offset: 0x13a8-0x13ac */
  __IO uint32_t PLL6CFGR1;         /*!< RCC PLL{y} Configuration Register 1                                           Address offset: 0x13b0 */
  __IO uint32_t PLL6CFGR2;         /*!< RCC PLL{y} Configuration Register 2                                           Address offset: 0x13b4 */
  __IO uint32_t PLL6CFGR3;         /*!< RCC PLL{y} Configuration Register 3                                           Address offset: 0x13b8 */
  __IO uint32_t PLL6CFGR4;         /*!< RCC PLL{y} Configuration Register 4                                           Address offset: 0x13bc */
  __IO uint32_t PLL6CFGR5;         /*!< RCC PLL{y} Configuration Register 5                                           Address offset: 0x13c0 */
       uint32_t RESERVED28;        /*!< Reserved                                                                      Address offset: 0x13c4 */
  __IO uint32_t PLL6CFGR6;         /*!< RCC PLL{y} Configuration Register 6                                           Address offset: 0x13c8 */
  __IO uint32_t PLL6CFGR7;         /*!< RCC PLL{y} Configuration Register 7                                           Address offset: 0x13cc */
       uint32_t RESERVED29[2];     /*!< Reserved                                                                      Address offset: 0x13d0-0x13d4 */
  __IO uint32_t PLL7CFGR1;         /*!< RCC PLL{y} Configuration Register 1                                           Address offset: 0x13d8 */
  __IO uint32_t PLL7CFGR2;         /*!< RCC PLL{y} Configuration Register 2                                           Address offset: 0x13dc */
  __IO uint32_t PLL7CFGR3;         /*!< RCC PLL{y} Configuration Register 3                                           Address offset: 0x13e0 */
  __IO uint32_t PLL7CFGR4;         /*!< RCC PLL{y} Configuration Register 4                                           Address offset: 0x13e4 */
  __IO uint32_t PLL7CFGR5;         /*!< RCC PLL{y} Configuration Register 5                                           Address offset: 0x13e8 */
       uint32_t RESERVED30;        /*!< Reserved                                                                      Address offset: 0x13ec */
  __IO uint32_t PLL7CFGR6;         /*!< RCC PLL{y} Configuration Register 6                                           Address offset: 0x13f0 */
  __IO uint32_t PLL7CFGR7;         /*!< RCC PLL{y} Configuration Register 7                                           Address offset: 0x13f4 */
       uint32_t RESERVED31[2];     /*!< Reserved                                                                      Address offset: 0x13f8-0x13fc */
  __IO uint32_t PLL8CFGR1;         /*!< RCC PLL{y} Configuration Register 1                                           Address offset: 0x1400 */
  __IO uint32_t PLL8CFGR2;         /*!< RCC PLL{y} Configuration Register 2                                           Address offset: 0x1404 */
  __IO uint32_t PLL8CFGR3;         /*!< RCC PLL{y} Configuration Register 3                                           Address offset: 0x1408 */
  __IO uint32_t PLL8CFGR4;         /*!< RCC PLL{y} Configuration Register 4                                           Address offset: 0x140c */
  __IO uint32_t PLL8CFGR5;         /*!< RCC PLL{y} Configuration Register 5                                           Address offset: 0x1410 */
       uint32_t RESERVED32;        /*!< Reserved                                                                      Address offset: 0x1414 */
  __IO uint32_t PLL8CFGR6;         /*!< RCC PLL{y} Configuration Register 6                                           Address offset: 0x1418 */
  __IO uint32_t PLL8CFGR7;         /*!< RCC PLL{y} Configuration Register 7                                           Address offset: 0x141c */
       uint32_t RESERVED33[15093]; /*!< Reserved                                                                      Address offset: 0x1420-0xfff0 */
  __IO uint32_t VERR;              /*!< RCC Version register                                                          Address offset: 0xfff4 */
  __IO uint32_t IDR;               /*!< RCC ID register                                                               Address offset: 0xfff8 */
  __IO uint32_t SIDR;              /*!< RCC Size ID register                                                          Address offset: 0xfffc */
} RCC_TypeDef;
/**
  * @brief RISC Resource Isolation Slave Controller Compartment (RIF User Spec Rev 1.0.14)
  */
typedef struct
{
  __IO uint32_t CIDCFGR;        /*!< RISC CID configuration register for peripheral x */
  __IO uint32_t SEMCR;          /*!< RISC Semaphore control register for peripheral x */
} RISC_Comp_TypeDef;

