STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp253cxx_ca35.h
/*******************  Bit definition for LTDC_ICR register  *******************/
#define LTDC_ICR_CLIF_Pos             (0U)
#define LTDC_ICR_CLIF_Msk             (0x1UL << LTDC_ICR_CLIF_Pos)/*!< 0x00000001 */
#define LTDC_ICR_CLIF                 LTDC_ICR_CLIF_Msk          /*!< clears the line interrupt flag */
#define LTDC_ICR_CFUWIF_Pos           (1U)
#define LTDC_ICR_CFUWIF_Msk           (0x1UL << LTDC_ICR_CFUWIF_Pos)  /*!< 0x00000002 */
#define LTDC_ICR_CFUWIF               LTDC_ICR_CFUWIF_Msk        /*!< clears the FIFO underrun warning interrupt flag */
#define LTDC_ICR_CTERRIF_Pos          (2U)
#define LTDC_ICR_CTERRIF_Msk          (0x1UL << LTDC_ICR_CTERRIF_Pos)   /*!< 0x00000004 */
#define LTDC_ICR_CTERRIF              LTDC_ICR_CTERRIF_Msk       /*!< clears the transfer error interrupt flag */
#define LTDC_ICR_CRRIF_Pos            (3U)
#define LTDC_ICR_CRRIF_Msk            (0x1UL << LTDC_ICR_CRRIF_Pos) /*!< 0x00000008 */
#define LTDC_ICR_CRRIF                LTDC_ICR_CRRIF_Msk         /*!< clears register reload interrupt flag */
#define LTDC_ICR_CFUKIF_Pos           (6U)
#define LTDC_ICR_CFUKIF_Msk           (0x1UL << LTDC_ICR_CFUKIF_Pos) /*!< 0x00000040 */
#define LTDC_ICR_CFUKIF               LTDC_ICR_CFUKIF_Msk        /*!< clears the FIFO underrun killing interrupt flag */
#define LTDC_ICR_CCRCIF_Pos           (7U)
#define LTDC_ICR_CCRCIF_Msk           (0x1UL << LTDC_ICR_CCRCIF_Pos)  /*!< 0x00000080 */
#define LTDC_ICR_CCRCIF               LTDC_ICR_CCRCIF_Msk        /*!< clears the CRC error interrupt flag */
#define LTDC_ICR_CFURIF_Pos           (8U)
#define LTDC_ICR_CFURIF_Msk           (0x1UL << LTDC_ICR_CFURIF_Pos)  /*!< 0x00000100 */
#define LTDC_ICR_CFURIF               LTDC_ICR_CFURIF_Msk        /*!< clears FIFO underrun error at rotation interrupt flag */

/******************  Bit definition for LTDC_LIPCR register  ******************/
#define LTDC_LIPCR_LIPOS_Pos          (0U)
#define LTDC_LIPCR_LIPOS_Msk          (0xFFFFUL << LTDC_LIPCR_LIPOS_Pos)      /*!< 0x0000FFFF */
#define LTDC_LIPCR_LIPOS              LTDC_LIPCR_LIPOS_Msk       /*!< line interrupt position */

/******************  Bit definition for LTDC_CPSR register  *******************/
#define LTDC_CPSR_CYPOS_Pos           (0U)
#define LTDC_CPSR_CYPOS_Msk           (0xFFFFUL << LTDC_CPSR_CYPOS_Pos)     /*!< 0x0000FFFF */
#define LTDC_CPSR_CYPOS               LTDC_CPSR_CYPOS_Msk        /*!< current Y position  */
#define LTDC_CPSR_CXPOS_Pos           (16U)
#define LTDC_CPSR_CXPOS_Msk           (0xFFFFUL << LTDC_CPSR_CXPOS_Pos)     /*!< 0xFFFF0000 */
#define LTDC_CPSR_CXPOS               LTDC_CPSR_CXPOS_Msk        /*!< current X position  */

/******************  Bit definition for LTDC_CDSR register  *******************/
#define LTDC_CDSR_VDES_Pos            (0U)
#define LTDC_CDSR_VDES_Msk            (0x1UL << LTDC_CDSR_VDES_Pos) /*!< 0x00000001 */
#define LTDC_CDSR_VDES                LTDC_CDSR_VDES_Msk         /*!< vertical data enable display status */
#define LTDC_CDSR_HDES_Pos            (1U)
#define LTDC_CDSR_HDES_Msk            (0x1UL << LTDC_CDSR_HDES_Pos) /*!< 0x00000002 */
#define LTDC_CDSR_HDES                LTDC_CDSR_HDES_Msk         /*!< horizontal data enable display status */
#define LTDC_CDSR_VSYNCS_Pos          (2U)
#define LTDC_CDSR_VSYNCS_Msk          (0x1UL << LTDC_CDSR_VSYNCS_Pos)   /*!< 0x00000004 */
#define LTDC_CDSR_VSYNCS              LTDC_CDSR_VSYNCS_Msk       /*!< vertical synchronization display status */
#define LTDC_CDSR_HSYNCS_Pos          (3U)
#define LTDC_CDSR_HSYNCS_Msk          (0x1UL << LTDC_CDSR_HSYNCS_Pos)   /*!< 0x00000008 */
#define LTDC_CDSR_HSYNCS              LTDC_CDSR_HSYNCS_Msk       /*!< horizontal synchronization display status */

/******************  Bit definition for LTDC_EDCR register  *******************/
#define LTDC_EDCR_OCYEN_Pos           (25U)
#define LTDC_EDCR_OCYEN_Msk           (0x1UL << LTDC_EDCR_OCYEN_Pos)  /*!< 0x02000000 */
#define LTDC_EDCR_OCYEN               LTDC_EDCR_OCYEN_Msk        /*!< output conversion to YCbCr 422 enable */
#define LTDC_EDCR_OCYSEL_Pos          (26U)
#define LTDC_EDCR_OCYSEL_Msk          (0x1UL << LTDC_EDCR_OCYSEL_Pos)   /*!< 0x04000000 */
#define LTDC_EDCR_OCYSEL              LTDC_EDCR_OCYSEL_Msk       /*!< output conversion to YCbCr 422 */
#define LTDC_EDCR_OCYCO_Pos           (27U)
#define LTDC_EDCR_OCYCO_Msk           (0x1UL << LTDC_EDCR_OCYCO_Pos)  /*!< 0x08000000 */
#define LTDC_EDCR_OCYCO               LTDC_EDCR_OCYCO_Msk        /*!< output conversion to YCbCr 422 */

/******************  Bit definition for LTDC_IER2 register  *******************/
#define LTDC_IER2_LIE_Pos             (0U)
#define LTDC_IER2_LIE_Msk             (0x1UL << LTDC_IER2_LIE_Pos)/*!< 0x00000001 */
#define LTDC_IER2_LIE                 LTDC_IER2_LIE_Msk          /*!< Line interrupt enable */
#define LTDC_IER2_FUWIE_Pos           (1U)
#define LTDC_IER2_FUWIE_Msk           (0x1UL << LTDC_IER2_FUWIE_Pos)  /*!< 0x00000002 */
#define LTDC_IER2_FUWIE               LTDC_IER2_FUWIE_Msk        /*!< FIFO underrun warning interrupt enable  */
#define LTDC_IER2_TERRIE_Pos          (2U)
#define LTDC_IER2_TERRIE_Msk          (0x1UL << LTDC_IER2_TERRIE_Pos)   /*!< 0x00000004 */
#define LTDC_IER2_TERRIE              LTDC_IER2_TERRIE_Msk       /*!< Transfer error interrupt enable */
#define LTDC_IER2_RRIE_Pos            (3U)
#define LTDC_IER2_RRIE_Msk            (0x1UL << LTDC_IER2_RRIE_Pos) /*!< 0x00000008 */
#define LTDC_IER2_RRIE                LTDC_IER2_RRIE_Msk         /*!< Register reload interrupt enable */
#define LTDC_IER2_FUKIE_Pos           (6U)
#define LTDC_IER2_FUKIE_Msk           (0x1UL << LTDC_IER2_FUKIE_Pos) /*!< 0x00000040 */
#define LTDC_IER2_FUKIE               LTDC_IER2_FUKIE_Msk        /*!< FIFO underrun killing error interrupt enable  */
#define LTDC_IER2_CRCIE_Pos           (7U)
#define LTDC_IER2_CRCIE_Msk           (0x1UL << LTDC_IER2_CRCIE_Pos)  /*!< 0x00000080 */
#define LTDC_IER2_CRCIE               LTDC_IER2_CRCIE_Msk        /*!< CRC error interrupt enable */
#define LTDC_IER2_FURIE_Pos           (8U)
#define LTDC_IER2_FURIE_Msk           (0x1UL << LTDC_IER2_FURIE_Pos)  /*!< 0x00000100 */
#define LTDC_IER2_FURIE               LTDC_IER2_FURIE_Msk        /*!< FIFO underrun error at rotation interrupt enable */

